byrmeng/arduino-esp32-core/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.ZigbeeMode=Zigbee Mode
menu.PinNumbers=Pin Numbering

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length
menu.SLOW_CLK_TPYE=Slow Clk Type(only for LoRaWAN)
menu.einksize=E-Ink Display Size
menu.NetworkLogLevel=Network Log Level
##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

##############################################################

deneyapkart.name=Deneyap Kart

deneyapkart.bootloader.tool=esptool_py
deneyapkart.bootloader.tool.default=esptool_py

deneyapkart.upload.tool=esptool_py
deneyapkart.upload.tool.default=esptool_py
deneyapkart.upload.tool.network=esp_ota

deneyapkart.upload.maximum_size=1310720
deneyapkart.upload.maximum_data_size=327680
deneyapkart.upload.flags=
deneyapkart.upload.extra_flags=

deneyapkart.serial.disableDTR=true
deneyapkart.serial.disableRTS=true

deneyapkart.build.tarch=xtensa
deneyapkart.build.bootloader_addr=0x1000
deneyapkart.build.target=esp32
deneyapkart.build.mcu=esp32
deneyapkart.build.core=esp32
deneyapkart.build.variant=deneyapkart
deneyapkart.build.board=DYDK

deneyapkart.build.f_cpu=240000000L
deneyapkart.build.flash_size=4MB
deneyapkart.build.flash_freq=80m
deneyapkart.build.flash_mode=dio
deneyapkart.build.boot=qio
deneyapkart.build.partitions=default
deneyapkart.build.defines=
deneyapkart.build.loop_core=
deneyapkart.build.event_core=

## IDE 2.0 Seems to not update the value
deneyapkart.menu.JTAGAdapter.default=Disabled
deneyapkart.menu.JTAGAdapter.default.build.copy_jtag_files=0
deneyapkart.menu.JTAGAdapter.external=FTDI Adapter
deneyapkart.menu.JTAGAdapter.external.build.openocdscript=esp32-wrover-kit-3.3v.cfg
deneyapkart.menu.JTAGAdapter.external.build.copy_jtag_files=1
deneyapkart.menu.JTAGAdapter.bridge=ESP USB Bridge
deneyapkart.menu.JTAGAdapter.bridge.build.openocdscript=esp32-bridge.cfg
deneyapkart.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

deneyapkart.menu.PSRAM.enabled=Enabled
deneyapkart.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
deneyapkart.menu.PSRAM.enabled.build.extra_libs=
deneyapkart.menu.PSRAM.disabled=Disabled
deneyapkart.menu.PSRAM.disabled.build.defines=
deneyapkart.menu.PSRAM.disabled.build.extra_libs=

deneyapkart.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
deneyapkart.menu.PartitionScheme.default.build.partitions=default
deneyapkart.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
deneyapkart.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
deneyapkart.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
deneyapkart.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
deneyapkart.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
deneyapkart.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
deneyapkart.menu.PartitionScheme.minimal.build.partitions=minimal
deneyapkart.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
deneyapkart.menu.PartitionScheme.no_ota.build.partitions=no_ota
deneyapkart.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
deneyapkart.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
deneyapkart.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
deneyapkart.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
deneyapkart.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
deneyapkart.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
deneyapkart.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
deneyapkart.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
deneyapkart.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
deneyapkart.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
deneyapkart.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
deneyapkart.menu.PartitionScheme.huge_app.build.partitions=huge_app
deneyapkart.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
deneyapkart.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
deneyapkart.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
deneyapkart.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
deneyapkart.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
deneyapkart.menu.PartitionScheme.fatflash.build.partitions=ffat
deneyapkart.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
deneyapkart.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
deneyapkart.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
deneyapkart.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
deneyapkart.menu.PartitionScheme.rainmaker=RainMaker 4MB
deneyapkart.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
deneyapkart.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
deneyapkart.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
deneyapkart.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
deneyapkart.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
deneyapkart.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
deneyapkart.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
deneyapkart.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4116480

deneyapkart.menu.CPUFreq.240=240MHz (WiFi/BT)
deneyapkart.menu.CPUFreq.240.build.f_cpu=240000000L
deneyapkart.menu.CPUFreq.160=160MHz (WiFi/BT)
deneyapkart.menu.CPUFreq.160.build.f_cpu=160000000L
deneyapkart.menu.CPUFreq.80=80MHz (WiFi/BT)
deneyapkart.menu.CPUFreq.80.build.f_cpu=80000000L
deneyapkart.menu.CPUFreq.40=40MHz (40MHz XTAL)
deneyapkart.menu.CPUFreq.40.build.f_cpu=40000000L
deneyapkart.menu.CPUFreq.26=26MHz (26MHz XTAL)
deneyapkart.menu.CPUFreq.26.build.f_cpu=26000000L
deneyapkart.menu.CPUFreq.20=20MHz (40MHz XTAL)
deneyapkart.menu.CPUFreq.20.build.f_cpu=20000000L
deneyapkart.menu.CPUFreq.13=13MHz (26MHz XTAL)
deneyapkart.menu.CPUFreq.13.build.f_cpu=13000000L
deneyapkart.menu.CPUFreq.10=10MHz (40MHz XTAL)
deneyapkart.menu.CPUFreq.10.build.f_cpu=10000000L

deneyapkart.menu.FlashMode.qio=QIO
deneyapkart.menu.FlashMode.qio.build.flash_mode=dio
deneyapkart.menu.FlashMode.qio.build.boot=qio
deneyapkart.menu.FlashMode.dio=DIO
deneyapkart.menu.FlashMode.dio.build.flash_mode=dio
deneyapkart.menu.FlashMode.dio.build.boot=dio

deneyapkart.menu.FlashFreq.80=80MHz
deneyapkart.menu.FlashFreq.80.build.flash_freq=80m
deneyapkart.menu.FlashFreq.40=40MHz
deneyapkart.menu.FlashFreq.40.build.flash_freq=40m

deneyapkart.menu.FlashSize.4M=4MB (32Mb)
deneyapkart.menu.FlashSize.4M.build.flash_size=4MB
deneyapkart.menu.FlashSize.8M=8MB (64Mb)
deneyapkart.menu.FlashSize.8M.build.flash_size=8MB
deneyapkart.menu.FlashSize.2M=2MB (16Mb)
deneyapkart.menu.FlashSize.2M.build.flash_size=2MB
deneyapkart.menu.FlashSize.16M=16MB (128Mb)
deneyapkart.menu.FlashSize.16M.build.flash_size=16MB

deneyapkart.menu.UploadSpeed.921600=921600
deneyapkart.menu.UploadSpeed.921600.upload.speed=921600
deneyapkart.menu.UploadSpeed.115200=115200
deneyapkart.menu.UploadSpeed.115200.upload.speed=115200
deneyapkart.menu.UploadSpeed.256000.windows=256000
deneyapkart.menu.UploadSpeed.256000.upload.speed=256000
deneyapkart.menu.UploadSpeed.230400.windows.upload.speed=256000
deneyapkart.menu.UploadSpeed.230400=230400
deneyapkart.menu.UploadSpeed.230400.upload.speed=230400
deneyapkart.menu.UploadSpeed.460800.linux=460800
deneyapkart.menu.UploadSpeed.460800.macosx=460800
deneyapkart.menu.UploadSpeed.460800.upload.speed=460800
deneyapkart.menu.UploadSpeed.512000.windows=512000
deneyapkart.menu.UploadSpeed.512000.upload.speed=512000

deneyapkart.menu.LoopCore.1=Core 1
deneyapkart.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
deneyapkart.menu.LoopCore.0=Core 0
deneyapkart.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

deneyapkart.menu.EventsCore.1=Core 1
deneyapkart.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
deneyapkart.menu.EventsCore.0=Core 0
deneyapkart.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

deneyapkart.menu.DebugLevel.none=None
deneyapkart.menu.DebugLevel.none.build.code_debug=0
deneyapkart.menu.DebugLevel.error=Error
deneyapkart.menu.DebugLevel.error.build.code_debug=1
deneyapkart.menu.DebugLevel.warn=Warn
deneyapkart.menu.DebugLevel.warn.build.code_debug=2
deneyapkart.menu.DebugLevel.info=Info
deneyapkart.menu.DebugLevel.info.build.code_debug=3
deneyapkart.menu.DebugLevel.debug=Debug
deneyapkart.menu.DebugLevel.debug.build.code_debug=4
deneyapkart.menu.DebugLevel.verbose=Verbose
deneyapkart.menu.DebugLevel.verbose.build.code_debug=5

deneyapkart.menu.EraseFlash.none=Disabled
deneyapkart.menu.EraseFlash.none.upload.erase_cmd=
deneyapkart.menu.EraseFlash.all=Enabled
deneyapkart.menu.EraseFlash.all.upload.erase_cmd=-e

